package com.macrodream.javase.p01base.c04operator;

/**
 * @author Macros.Zhang
 * @date 4/28/2022 20:15
 *      运算符 一种特殊符号，数据运算、赋值和比较等
 *          算术运算符
 *              运算符         运算          范例          结果
 *              +              正号           +3          3
 *              -              负号           b=4;-b      -4
 *              +               加           5+5          10
 *              -               减           6-4          2
 *              *               乘           3*4          12
 *              /               除           5/5          1
 *              %             取模(取余)      7%5          2
 *              ++    自增(前)，先运算后取值   a=2;b=++a;   a=3;b=3
 *              ++    自增(后)，先取值后运算   a=2;b=a++;   a=3;b=2
 *              --    自减(前)，先运算后取值   a=2;b=--a;   a=1;b=1
 *              --    自减(后)，先取值后运算   a=2;b=a--;   a=1;b=2
 *              +           字符串连接        "He"+"llo"   "Hello"
 *          赋值运算符
 *          比较运算符(关系运算符)
 *          逻辑运算符
 *          位运算符
 *          三元运算符
 */
public class P01Operator {
}
