package com.macrodream.javase.p01base.c02identifier;

/**
 * @author Macros.Zhang
 * @date 4/25/2022 22:08
 *  标识符
 *      Java对各种 变量 、 方法 和 类 等（）要素命名是使用的字符序列称为标识符
 *      技巧 ： 凡是可以起名字的地方都叫标识符
 *  定义合法标识符规则  >>  不遵守，编译不通过
 *      由26个英文字母大小写，0-9，_或$组成
 *      数字不可以开头
 *      不可以使用关键字好保留字，但能包含关键字和保留字
 *      Java中严格区分大小写，长度无限制
 *      不能包含空格
 *  Java中名称命名规范  >>  不遵守，编译通过，建议遵守
 *      包名：多个单词所有字母小写 xxxyyyzzz
 *      类名、接口名：多个单词所有单词首字母大写 XxxYyyZzz
 *      变量名、方法名：多个单词，第一个单词小写，第二个单词开始首字母大写 xxxYyyZzz
 *      常量名：所有字母都大写。多个单词用下划线连接  XXX_YYY_ZZZ
 *   注意
 *      1. 见明知意，代码即文档
 *      2. Unicode字符集，可以用汉字声明，但不建议
 *      代码整洁之道
 */
public class Identifier {

}
